using System.IO;

namespace SavedData
{
    // серіалізуємий клас, який зберігає дані про записки
    [System.Serializable]
    public class NotesData
    {
        private const string KEY = "NotesData";         // ключ зберігання

        public bool[] isActivated = new bool[8];        // дані про отримані записки

        // конструктор по замовчуванню
        public NotesData()
        {
            isActivated = new bool[8];
        }

        // функція для збереження даних в файл по ключу
        public void Save()
        {
            StorageService.Save(KEY, this);
        }

        // функція для завантаження ігрових даних по ключу
        public NotesData Load()
        {
            try
            {
                var data = StorageService.Load<NotesData>(KEY);
                return data;
            }
            catch (FileNotFoundException)
            {
                Save();
                return this;
            }
        }


        #region Notes
        // сбірник записок
        public readonly string[] Notes =
        {
            "Після минулої сесії я був змушений звернутися до психолога. " +
                "Він запропонував мені вести щоденник і декілька разів на " +
                "день записувати те, що зі мною відбувається і емоції, які " +
                "я відчуваю. Якась маячня, але надіюсь це допоможе, бо щойно " +
                "я бачів ну дуже реалістичні глюки... Думаю краще вийти " +
                "подихати свіжим повітрям...",

            "Це не схоже на глюки. Я б собі не повірив, але ця Поганка така " +
                "же матеріальна, як і я. Заїхав йому по лицю. Кулак і досі " +
                "болить... Не можу позбавитися від відчуття, що за мною хтось слідкує.",

            "Думав, якщо вмиюсь стане краще, але бачу ще одну тварюку. Чомусь " +
                "інший колір. Знайшов пістолет. Не можу зрозуміти де інші " +
                "студенти¿ За мною хтось іде, така знайома потвора, вона ніби " +
                "прийшла з моїх нічних кошмарів.",


            "Ні, присягаюсь, це не шиза. Я все обдумав, я студент, я маю критичне " +
                "мислення і скоріше повірю у те, що це нова форма короновірусу, " +
                "ніж у те, що це глюки. Ви не розумієте, наскільки все реально. " +
                "Благо, я вже на другому поверсі, треба забиратися..",


            "Що за... Що це за закуток імені Стівена Кінга? І звідки гроші на " +
                "таємні ходи? Треба запам'ятати, прийду сюди ночувати, якщо " +
                "виженуть з общаги... Якщо виживу... Гарно, що є дробовик.",


            "Коли я нервую, то рву те, що у моїх кишенях. Здається я порвав " +
                "заліковку.  Плювати, головне, що я вже на першому поверсі. " +
                "Чому потвора, яка мене переслідує, нашіптує моє ім'я і хвалить C++?",


            "Тут мені і місце... Нащо в університеті дит. садок... Тут має бути " +
                "щось корисне... Патрони, ножі...  Концентрована кислота...",


            "О, краще б я пішов на сантехніка! Казала мені мати, не сидіти у " +
                "своїх комп'ютерах, мабуть це така кара. Ну, хоч дробовик є. Якщо " +
                "помру, не прийдеться писати дипломну...",
        };

        // остання записка
        public readonly string NoteEndgame =
                "Кров. Усюди кров. Це був я. Весь цей час, це був я. Я вбивця. " +
                "Що я накоїв... Це були не мостри. Не монстри - люди... Але зброя... " +
                "Вона дерев'яна...";

        // збірник назв записок
        public readonly string[] Titles =
        {
            "8:35 День x, місяць y",
            "8:49 День x, місяць y",
            "9:03 День x, місяць y",
            "9:10 День y, місяць x",
            "15:09 День y, місяць x",
            "2309 Ьнед y, місяць x",
            "~9?",
            "010010101111",
        };
        #endregion
    }
}

