using UnityEngine;
using UnityEngine.UI;

public class LoadingScreenSetText : MonoBehaviour
{
    private void Start()
    {
        this.GetComponent<Text>().text = discriptions[GetRandomIndex()];
    }

    private int GetRandomIndex()
    {
        return Random.Range(0, discriptions.Length);
    }


    private string[] discriptions =
{
        "У стрибку шкода від молотка подвоюється!",


        "Інфернальний ловець дуже швидко хапає " +
            "свою ціль та не відпускає до тих пір," +
            " доки не знищить її.",


        "Тиран – це те, що ти побачиш востаннє…",


        "Тиран – це справжній феєрверк на полі бою!",


        "Поганки дуже слабкі, але за рахунок кількості" +
            " здатні принести великі неприємності.",


        "Хранитель глибин не дасть вам сховатися! Якщо ви" +
            " спробуєте це зробити – вас настигнуть його " +
            "прислужники Поганки.",


        "Чому “Строяк”?",


        "В древніх записах бібліотеки написано, що Хранитель " +
            "глибин – це дух попереднього ректора університету…",


        "Складність гри залежить не від сили монстрів, а від " +
            "здібностей персонажа. ",


        "Бібліотека повна таємниць… та Поганок.",
    };
}
